/*************************************************************************
	> File Name: 1422.c
	> Author: yufangze
	> Mail: 2224590123@qq.com
	> Created Time: 2018年09月28日 星期五 16时35分28秒
 ************************************************************************/
#include <stdio.h>

int main() {
    int n;
    double sum;
    scanf("%d", &n);
    if (n <= 150) {
        sum = n * 0.4463;
    } else if (n <= 400) {
        sum = 150 * 0.4463 + (n - 150) * 0.4663;
    } else {
        sum = 150 * 0.4463 + (400 - 150) * 0.4663 + (n - 400) * 0.5663;
    }
    printf("%.1lf\n", sum);
    return 0;
}
